{
  "title": "Lab Aide: BIO 181 (FWS Eligible) Student Worker III",
  "keywords": [
    "Lab Aide",
    "BIO 181",
    "FWS Eligible",
    "Student Worker III",
    "Review",
    "Dreamscape Learn",
    "lecture material",
    "course",
    "links",
    "content",
    "office hours",
    "Spring A live",
    "students",
    "Student Recruitment",
    "Type Student Hire",
    "Hourly Campus",
    "Location Campus: Tempe",
    "Department Name Sols Administration & Faculty",
    "Full-Time/Part-Time Part-Time",
    "VP Code EXEC VP/PROVOST",
    "Grant Funded Position",
    "Salary Range $15.12 per hour",
    "Close Date 13-December-2023"
  ],
  "purpose": "To assist in reviewing Dreamscape Learn activity for errors and ensuring the functionality of lecture materials and course content. Additionally, to provide support during office hours and assist with student recruitment.",
  "duties_responsibilities": [
    "Monitor discussion boards",
    "Review material",
    "Help answer students' emails"
  ],
  "required_qualifications": [
    "Significant amount of specialized training or experience"
  ],
  "preferred_qualifications": [
    "Has been an ATA in Fall B Bio 181 online with Deanna Larson"
  ],
  "company_name": "Arizona State University",
  "company_info": {
    "overview": "Arizona State University is a new model for American higher education, combining academic excellence, entrepreneurial energy, and broad access. It comprises four differentiated campuses and serves more than 100,000 students in metropolitan Phoenix, Arizona. ASU champions intellectual and cultural diversity and is committed to being a tobacco-free university.",
    "mission": "To positively impact the economic, social, cultural, and environmental health of the communities it serves through innovative and interdisciplinary research and education.",
    "values": "ASU values intellectual and cultural diversity and provides equal opportunities for all applicants, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other basis protected by law."
  }
}